Certification/src/AccumulationRegisters/ЗначенияПоказателей/ЗначенияПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗначенияПоказателей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>EnumRef.ПоказателиКарточек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Certification/src/AccumulationRegisters/ЗначенияПоказателей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет движения по показателям пожеланий.
//
// Параметры:
//  Движения   - ДокументОбъект.Обращение.Движения.ЗначенияПоказателей - движения документа.
//  Объект     - СправочникСсылка.Консультации, СправочникСсылка.Ошибки, СправочникСсылка.Пожелание - объект базы знаний.
//  Показатель - ПеречислениеСсылка.ПоказателиПожеланий - показатель
//  Значение   - Число - значение показателя
//
Процедура ДобавитьДвижение(Движения, Период, Объект, Показатель, Значение) Экспорт
        
    УстановитьПривилегированныйРежим(Истина);
    
    Движения.Записывать = Истина;
    
    Движение = Движения.Добавить();
    Движение.Период = Период;
    Движение.Объект = Объект;
    Движение.Показатель = Показатель;
    Движение.Значение = Значение;
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
